# Pandas

One dimensional ndarray with axis labels

#### Installation

In [1]:
! pip install pandas

zsh:1: command not found: pip

#### Import the library

In [2]:
import pandas as pd
import numpy as np

#### Convert a list to Series

In [3]:
my_pets = ['Lion','Cat','Birds','Fish']
pd.Series(my_pets)

0     Lion
1      Cat
2    Birds
3     Fish
dtype: object

#### Add index to series

* Length of index list should be equal to length of values in series

In [4]:
my_days = ['Monday','Tuesday','Wednesday','Thursday','Friday']
my_courses = ['Economics','Geography','Finance','Mathametics','History']
pd.Series(my_courses,index=my_days)

Monday         Economics
Tuesday        Geography
Wednesday        Finance
Thursday     Mathametics
Friday           History
dtype: object

In [5]:
days = pd.Series(my_days,index="Day1 Day2 Day3 Day4 Day5".split())
courses = pd.Series(my_courses,index="Day1 Day2 Day3 Day4 Day5".split())

In [6]:
courses['Day5']

'History'

In [7]:
days + ':' + courses

Day1        Monday:Economics
Day2       Tuesday:Geography
Day3       Wednesday:Finance
Day4    Thursday:Mathametics
Day5          Friday:History
dtype: object

#### Series From Dictionary

In [8]:
sports ={'Football':'Spain','NBA':'USA','Cricket':'India'}
sports_series = pd.Series(sports)
sports_series

Football    Spain
NBA           USA
Cricket     India
dtype: object

#### Find value at location by index label

In [9]:
sports_series.loc['Cricket']

'India'

#### Find Value at location by index number

In [10]:
sports_series.iloc[2]

'India'

#### DataFrame

Two-Dimensional, size-mutable, potentially heterogenous tabular data

#### Create a dataframe from random numbers array

In [11]:
my_dataframe = pd.DataFrame(np.random.randn(10,5),index='row1 row2 row3 row4 row5 row6 row7 row8 row9 row10'.split(),columns='column1 column2 column3 column4 column5'.split())
my_dataframe

        column1   column2   column3   column4   column5
row1  -0.139347 -0.373430 -1.921363  0.432947  0.826339
row2   0.286645 -0.873916  1.347885  0.682560  0.732028
row3  -1.426505  0.346695  0.292484 -0.788040  0.267752
row4   1.906606  0.427032 -0.917601 -0.593008 -0.909449
row5  -0.051351  1.336648  1.244988 -1.525128 -0.754384
row6   2.371287 -0.466116 -0.646073  0.685806  0.374711
row7   2.749655  0.205904  0.453801 -0.220763  0.336647
row8   0.149038 -1.199708 -1.656562  2.047832 -0.416109
row9   0.425928  0.280945 -0.675718 -0.074607 -0.848821
row10 -2.216378 -0.846389  2.685789 -0.312498 -1.343919

#### Selecting a single column

In [12]:
my_dataframe['column1']

row1    -0.139347
row2     0.286645
row3    -1.426505
row4     1.906606
row5    -0.051351
row6     2.371287
row7     2.749655
row8     0.149038
row9     0.425928
row10   -2.216378
Name: column1, dtype: float64

#### Add a new column

In [13]:
my_dataframe['column6']=my_dataframe['column1']*2
my_dataframe

        column1   column2   column3   column4   column5   column6
row1  -0.139347 -0.373430 -1.921363  0.432947  0.826339 -0.278694
row2   0.286645 -0.873916  1.347885  0.682560  0.732028  0.573289
row3  -1.426505  0.346695  0.292484 -0.788040  0.267752 -2.853011
row4   1.906606  0.427032 -0.917601 -0.593008 -0.909449  3.813212
row5  -0.051351  1.336648  1.244988 -1.525128 -0.754384 -0.102701
row6   2.371287 -0.466116 -0.646073  0.685806  0.374711  4.742573
row7   2.749655  0.205904  0.453801 -0.220763  0.336647  5.499309
row8   0.149038 -1.199708 -1.656562  2.047832 -0.416109  0.298076
row9   0.425928  0.280945 -0.675718 -0.074607 -0.848821  0.851857
row10 -2.216378 -0.846389  2.685789 -0.312498 -1.343919 -4.432756

#### Drop a column

In [14]:
my_dataframe.drop('column4',axis=1)

        column1   column2   column3   column5   column6
row1  -0.139347 -0.373430 -1.921363  0.826339 -0.278694
row2   0.286645 -0.873916  1.347885  0.732028  0.573289
row3  -1.426505  0.346695  0.292484  0.267752 -2.853011
row4   1.906606  0.427032 -0.917601 -0.909449  3.813212
row5  -0.051351  1.336648  1.244988 -0.754384 -0.102701
row6   2.371287 -0.466116 -0.646073  0.374711  4.742573
row7   2.749655  0.205904  0.453801  0.336647  5.499309
row8   0.149038 -1.199708 -1.656562 -0.416109  0.298076
row9   0.425928  0.280945 -0.675718 -0.848821  0.851857
row10 -2.216378 -0.846389  2.685789 -1.343919 -4.432756

In [15]:
my_dataframe

        column1   column2   column3   column4   column5   column6
row1  -0.139347 -0.373430 -1.921363  0.432947  0.826339 -0.278694
row2   0.286645 -0.873916  1.347885  0.682560  0.732028  0.573289
row3  -1.426505  0.346695  0.292484 -0.788040  0.267752 -2.853011
row4   1.906606  0.427032 -0.917601 -0.593008 -0.909449  3.813212
row5  -0.051351  1.336648  1.244988 -1.525128 -0.754384 -0.102701
row6   2.371287 -0.466116 -0.646073  0.685806  0.374711  4.742573
row7   2.749655  0.205904  0.453801 -0.220763  0.336647  5.499309
row8   0.149038 -1.199708 -1.656562  2.047832 -0.416109  0.298076
row9   0.425928  0.280945 -0.675718 -0.074607 -0.848821  0.851857
row10 -2.216378 -0.846389  2.685789 -0.312498 -1.343919 -4.432756

#### Drop from orignal data

In [16]:
my_dataframe.drop('column4',axis=1,inplace=True)
my_dataframe

        column1   column2   column3   column5   column6
row1  -0.139347 -0.373430 -1.921363  0.826339 -0.278694
row2   0.286645 -0.873916  1.347885  0.732028  0.573289
row3  -1.426505  0.346695  0.292484  0.267752 -2.853011
row4   1.906606  0.427032 -0.917601 -0.909449  3.813212
row5  -0.051351  1.336648  1.244988 -0.754384 -0.102701
row6   2.371287 -0.466116 -0.646073  0.374711  4.742573
row7   2.749655  0.205904  0.453801  0.336647  5.499309
row8   0.149038 -1.199708 -1.656562 -0.416109  0.298076
row9   0.425928  0.280945 -0.675718 -0.848821  0.851857
row10 -2.216378 -0.846389  2.685789 -1.343919 -4.432756

#### Use index to access row

In [17]:
my_dataframe.iloc[1]

column1    0.286645
column2   -0.873916
column3    1.347885
column5    0.732028
column6    0.573289
Name: row2, dtype: float64

#### Fnd a value using row and column index

In [18]:
my_dataframe.loc['row7','column2']

0.2059038970380228

In [19]:
my_dataframe.index

Index(['row1', 'row2', 'row3', 'row4', 'row5', 'row6', 'row7', 'row8', 'row9',
       'row10'],
      dtype='object')

#### Add Series to DataFrame

In [20]:
my_dataframe['spin']=['sp1','sp2','sp3','sp4','sp5','sp6','sp7','sp8','sp9','sp10']
my_dataframe

        column1   column2   column3   column5   column6  spin
row1  -0.139347 -0.373430 -1.921363  0.826339 -0.278694   sp1
row2   0.286645 -0.873916  1.347885  0.732028  0.573289   sp2
row3  -1.426505  0.346695  0.292484  0.267752 -2.853011   sp3
row4   1.906606  0.427032 -0.917601 -0.909449  3.813212   sp4
row5  -0.051351  1.336648  1.244988 -0.754384 -0.102701   sp5
row6   2.371287 -0.466116 -0.646073  0.374711  4.742573   sp6
row7   2.749655  0.205904  0.453801  0.336647  5.499309   sp7
row8   0.149038 -1.199708 -1.656562 -0.416109  0.298076   sp8
row9   0.425928  0.280945 -0.675718 -0.848821  0.851857   sp9
row10 -2.216378 -0.846389  2.685789 -1.343919 -4.432756  sp10

#### Rename the columns

In [21]:

my_dataframe.rename(columns={
    'column1':'first',
    'column2':'second',
    'column3':'third',
    'column5':'fifth',
    'column6':'sixth',
    },inplace=True)
my_dataframe

          first    second     third     fifth     sixth  spin
row1  -0.139347 -0.373430 -1.921363  0.826339 -0.278694   sp1
row2   0.286645 -0.873916  1.347885  0.732028  0.573289   sp2
row3  -1.426505  0.346695  0.292484  0.267752 -2.853011   sp3
row4   1.906606  0.427032 -0.917601 -0.909449  3.813212   sp4
row5  -0.051351  1.336648  1.244988 -0.754384 -0.102701   sp5
row6   2.371287 -0.466116 -0.646073  0.374711  4.742573   sp6
row7   2.749655  0.205904  0.453801  0.336647  5.499309   sp7
row8   0.149038 -1.199708 -1.656562 -0.416109  0.298076   sp8
row9   0.425928  0.280945 -0.675718 -0.848821  0.851857   sp9
row10 -2.216378 -0.846389  2.685789 -1.343919 -4.432756  sp10

#### Read a csv file

In [23]:
data = pd.read_csv('data/Automobile.csv')
data

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,13495
1,3,168,alfa-romero,gas,std,two,convertible,rwd,front,88.6,...,130,mpfi,3.47,2.68,9.0,111,5000,21,27,16500
2,1,168,alfa-romero,gas,std,two,hatchback,rwd,front,94.5,...,152,mpfi,2.68,3.47,9.0,154,5000,19,26,16500
3,2,164,audi,gas,std,four,sedan,fwd,front,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,4wd,front,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845
197,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
198,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
199,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.40,23.0,106,4800,26,27,22470
200,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

#### Description of data inside DataFrame

In [24]:
data.describe()

,symboling,normalized_losses,wheel_base,length,width,height,curb_weight,engine_size,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
count,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000,201.000000
mean,0.840796,125.189055,98.797015,174.200995,65.889055,53.766667,2555.666667,126.875622,3.329701,3.261741,10.164279,103.263682,5121.393035,25.179104,30.686567,13207.129353
std,1.254802,33.572966,6.066366,12.322175,2.101471,2.447822,517.296727,41.546834,0.268166,0.317875,4.004965,37.389372,479.624905,6.423220,6.815150,7947.066342
min,-2.000000,65.000000,86.600000,141.100000,60.300000,47.800000,1488.000000,61.000000,2.540000,2.070000,7.000000,48.000000,4150.000000,13.000000,16.000000,5118.000000
25%,0.000000,101.000000,94.500000,166.800000,64.100000,52.000000,2169.000000,98.000000,3.150000,3.110000,8.600000,70.000000,4800.000000,19.000000,25.000000,7775.000000
50%,1.000000,122.000000,97.000000,173.200000,65.500000,54.100000,2414.000000,120.000000,3.310000,3.290000,9.000000,95.000000,5200.000000,24.000000,30.000000,10295.000000
75%,2.000000,150.000000,102.400000,183.500000,66.600000,55.500000,2926.000000,141.000000,3.580000,3.460000,9.400000,116.000000,5500.000000,30.000000,34.000000,16500.000000
max,3.000000,256.000000,120.900000,208.100000,72.000000,59.800000,4066.000000,326.000000,3.940000,4.170000,23.000000,262.000000,6600.000000,49.000000,54.000000,45400.000000

#### Information on DataFrame

provides inferred data types

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 201 entries, 0 to 200
Data columns (total 26 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   symboling            201 non-null    int64
 1   normalized_losses    201 non-null    int64
 2   make                 201 non-null    object
 3   fuel_type            201 non-null    object
 4   aspiration           201 non-null    object
 5   number_of_doors      201 non-null    object
 6   body_style           201 non-null    object
 7   drive_wheels         201 non-null    object
 8   engine_location      201 non-null    object
 9   wheel_base           201 non-null    float64
 10  length               201 non-null    float64
 11  width                201 non-null    float64
 12  height               201 non-null    float64
 13  curb_weight          201 non-null    int64
 14  engine_type          201 non-null    object
 15  number_of_cylinders  201 non-null    object
 16  engine_size          201 non-null    int64
 17  fuel_system          201 non-null    object
 18  bore                 201 non-null    float64
 19  stroke               201 non-null    float64
 20  compression_ratio    201 non-null    float64
 21  horsepower           201 non-null    int64
 22  peak_rpm             201 non-null    int64
 23  city_mpg             201 non-null    int64
 24  highway_mpg          201 non-null    int64
 25  price                201 non-null    int64
dtypes: float64(7), int64(9), object(10)
memory usage: 41.0+ KB

#### Selecting a column

In [26]:
data['make']

0      alfa-romero
1      alfa-romero
2      alfa-romero
3             audi
4             audi
          ...
196          volvo
197          volvo
198          volvo
199          volvo
200          volvo
Name: make, Length: 201, dtype: object

#### Indexes on dataset

In [27]:
data.index

RangeIndex(start=0, stop=201, step=1)

#### Find Null Values

In [28]:
data.isnull()

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
197,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
198,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
199,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False
200,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,False,False

In [29]:
data.isnull().sum()

symboling              0
normalized_losses      0
make                   0
fuel_type              0
aspiration             0
number_of_doors        0
body_style             0
drive_wheels           0
engine_location        0
wheel_base             0
length                 0
width                  0
height                 0
curb_weight            0
engine_type            0
number_of_cylinders    0
engine_size            0
fuel_system            0
bore                   0
stroke                 0
compression_ratio      0
horsepower             0
peak_rpm               0
city_mpg               0
highway_mpg            0
price                  0
dtype: int64

#### Find the percentile (quartile) values for DataFrame

In [30]:
data.describe().T

,count,mean,std,min,25%,50%,75%,max
symboling,201.0,0.840796,1.254802,-2.00,0.00,1.00,2.00,3.00
normalized_losses,201.0,125.189055,33.572966,65.00,101.00,122.00,150.00,256.00
wheel_base,201.0,98.797015,6.066366,86.60,94.50,97.00,102.40,120.90
length,201.0,174.200995,12.322175,141.10,166.80,173.20,183.50,208.10
width,201.0,65.889055,2.101471,60.30,64.10,65.50,66.60,72.00
height,201.0,53.766667,2.447822,47.80,52.00,54.10,55.50,59.80
curb_weight,201.0,2555.666667,517.296727,1488.00,2169.00,2414.00,2926.00,4066.00
engine_size,201.0,126.875622,41.546834,61.00,98.00,120.00,141.00,326.00
bore,201.0,3.329701,0.268166,2.54,3.15,3.31,3.58,3.94
stroke,201.0,3.261741,0.317875,2.07,3.11,3.29,3.46,4.17
compression_ratio,201.0,10.164279,4.004965,7.00,8.60,9.00,9.40,23.00
horsepower,201.0,103.263682,37.389372,48.00,70.00,95.00,116.00,262.00
peak_rpm,201.0,5121.393035,479.624905,4150.00,4800.00,5200.00,5500.00,6600.00
city_mpg,201.0,25.179104,6.423220,13.00,19.00,24.00,30.00,49.00
highway_mpg,201.0,30.686567,6.815150,16.00,25.00,30.00,34.00,54.00
price,201.0,13207.129353,7947.066342,5118.00,7775.00,10295.00,16500.00,45400.00

#### Conditional Query and display selectd columns

In [31]:
data[data['price']>20000][['make','price']]

              make  price
8             audi  23875
11             bmw  20970
12             bmw  21105
13             bmw  24565
14             bmw  30760
15             bmw  41315
16             bmw  36880
44          jaguar  32250
45          jaguar  35550
46          jaguar  36000
64   mercedes-benz  25552
65   mercedes-benz  28248
66   mercedes-benz  28176
67   mercedes-benz  31600
68   mercedes-benz  34184
69   mercedes-benz  35056
70   mercedes-benz  40960
71   mercedes-benz  45400
122        porsche  22018
123        porsche  32528
124        porsche  34028
125        porsche  37028
198          volvo  21485
199          volvo  22470
200          volvo  22625

#### Multiple coditions for filtering

In [32]:
data[(data['make']=='volvo')&(data['price']<50000)]

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
190,-2,103,volvo,gas,std,four,sedan,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,12940
191,-1,74,volvo,gas,std,four,wagon,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,13415
192,-2,103,volvo,gas,std,four,sedan,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,24,28,15985
193,-1,74,volvo,gas,std,four,wagon,rwd,front,104.3,...,141,mpfi,3.78,3.15,9.5,114,5400,24,28,16515
194,-2,103,volvo,gas,turbo,four,sedan,rwd,front,104.3,...,130,mpfi,3.62,3.15,7.5,162,5100,17,22,18420
195,-1,74,volvo,gas,turbo,four,wagon,rwd,front,104.3,...,130,mpfi,3.62,3.15,7.5,162,5100,17,22,18950
196,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845
197,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
198,-1,95,volvo,gas,std,four,sedan,rwd,front,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
199,-1,95,volvo,diesel,turbo,four,sedan,rwd,front,109.1,...,145,idi,3.01,3.40,23.0,106,4800,26,27,22470
200,-1,95,volvo,gas,turbo,four,sedan,rwd,front,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

In [33]:
data[(data['make']=='volvo')&(data['price']<50000)][['make','price']]

      make  price
190  volvo  12940
191  volvo  13415
192  volvo  15985
193  volvo  16515
194  volvo  18420
195  volvo  18950
196  volvo  16845
197  volvo  19045
198  volvo  21485
199  volvo  22470
200  volvo  22625

#### Dealing with null values in data

In [34]:
df = pd.DataFrame({'value1':[100,np.nan,234,np.nan],
                   'value2':[300,121,np.nan,np.nan],
                   'value3':['XUI','VYU','NMA','IUY']})
df.head()

   value1  value2 value3
0   100.0   300.0    XUI
1     NaN   121.0    VYU
2   234.0     NaN    NMA
3     NaN     NaN    IUY

In [35]:
df.isnull()

   value1  value2  value3
0   False   False   False
1    True   False   False
2   False    True   False
3    True    True   False

In [36]:
df.isna()

   value1  value2  value3
0   False   False   False
1    True   False   False
2   False    True   False
3    True    True   False

In [37]:
df.isna().sum()

value1    2
value2    2
value3    0
dtype: int64

#### Filling null values with mean

In [38]:
df.fillna(df.mean(),inplace=True)
df

   value1  value2 value3
0   100.0   300.0    XUI
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY

#### Sorting

In [39]:
df.sort_values(by='value2',ascending=True)

   value1  value2 value3
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY
0   100.0   300.0    XUI

In [40]:
data.sort_values(by='price',ascending=False).head()

,symboling,normalized_losses,make,fuel_type,aspiration,number_of_doors,body_style,drive_wheels,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
71,1,140,mercedes-benz,gas,std,two,hardtop,rwd,front,112.0,...,304,mpfi,3.80,3.35,8.0,184,4500,14,16,45400
15,0,149,bmw,gas,std,two,sedan,rwd,front,103.5,...,209,mpfi,3.62,3.39,8.0,182,5400,16,22,41315
70,0,140,mercedes-benz,gas,std,four,sedan,rwd,front,120.9,...,308,mpfi,3.80,3.35,8.0,184,4500,14,16,40960
125,3,128,porsche,gas,std,two,convertible,rwd,rear,89.5,...,194,mpfi,3.74,2.90,9.5,207,5900,17,25,37028
16,0,149,bmw,gas,std,four,sedan,rwd,front,110.0,...,209,mpfi,3.62,3.39,8.0,182,5400,15,20,36880

#### Group By and Count

In [41]:
data['make'].value_counts()

toyota           32
nissan           18
mazda            17
mitsubishi       13
honda            13
subaru           12
volkswagen       12
peugot           11
volvo            11
dodge             9
bmw               8
mercedes-benz     8
plymouth          7
saab              6
audi              6
porsche           4
chevrolet         3
jaguar            3
alfa-romero       3
renault           2
isuzu             2
mercury           1
Name: make, dtype: int64

#### Concatenate dataframes

In [42]:
mm = {'one':[2,3,1,4,5],
      'two':[5,4,3,2,1],
      'letter':['a','a','b','b','c']}
mm1 = pd.DataFrame(mm)
mm1

   one  two letter
0    2    5      a
1    3    4      a
2    1    3      b
3    4    2      b
4    5    1      c

In [43]:
df

   value1  value2 value3
0   100.0   300.0    XUI
1   167.0   121.0    VYU
2   234.0   210.5    NMA
3   167.0   210.5    IUY

In [44]:
new_df=pd.concat([df,mm1])
new_df

   value1  value2 value3  one  two letter
0   100.0   300.0    XUI  NaN  NaN    NaN
1   167.0   121.0    VYU  NaN  NaN    NaN
2   234.0   210.5    NMA  NaN  NaN    NaN
3   167.0   210.5    IUY  NaN  NaN    NaN
0     NaN     NaN    NaN  2.0  5.0      a
1     NaN     NaN    NaN  3.0  4.0      a
2     NaN     NaN    NaN  1.0  3.0      b
3     NaN     NaN    NaN  4.0  2.0      b
4     NaN     NaN    NaN  5.0  1.0      c

In [45]:
new_df1=pd.concat([df,mm1],axis=1)
new_df1

   value1  value2 value3  one  two letter
0   100.0   300.0    XUI    2    5      a
1   167.0   121.0    VYU    3    4      a
2   234.0   210.5    NMA    1    3      b
3   167.0   210.5    IUY    4    2      b
4     NaN     NaN    NaN    5    1      c

#### Join and merge

In [46]:
sales = {
    'Jones':10000,
    'Chris':5000,
    'Piyush':440,
    'Meera':6700,
    'Rahul':300
}
region = {
    'Jones':'West',
    'Chris':np.nan,
    'Piyush':'West',
    'Meera':np.nan,
    'Anthony':'East',
    'Ellen':'South',
    'Josh': 'West',
    'Simran': 'East',
    'Oscar':'North'
}

In [47]:
sales_df = pd.DataFrame.from_dict(sales,orient='index',columns=['sales'])
sales_df

        sales
Jones   10000
Chris    5000
Piyush    440
Meera    6700
Rahul     300

In [48]:
region_df = pd.DataFrame.from_dict(region,orient='index',columns=['region'])
region_df

        region
Jones     West
Chris      NaN
Piyush    West
Meera      NaN
Anthony   East
Ellen    South
Josh      West
Simran    East
Oscar    North

#### Left Join

In [49]:
joined_df = region_df.join(sales_df,how='left')
joined_df

        region    sales
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN

#### Right Join

In [50]:
joined_df = region_df.join(sales_df,how='right')
joined_df

       region  sales
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700
Rahul     NaN    300

#### Inner Join

In [51]:
joined_df = region_df.join(sales_df,how='inner')
joined_df

       region  sales
Jones    West  10000
Chris     NaN   5000
Piyush   West    440
Meera     NaN   6700

#### Outer Join

In [52]:
joined_df = region_df.join(sales_df,how='outer')
joined_df

        region    sales
Anthony   East      NaN
Chris      NaN   5000.0
Ellen    South      NaN
Jones     West  10000.0
Josh      West      NaN
Meera      NaN   6700.0
Oscar    North      NaN
Piyush    West    440.0
Rahul      NaN    300.0
Simran    East      NaN

In [53]:
region_df.index.name='names'
sales_df.index.name='names'

#### Merge

In [54]:
pd.merge(region_df,sales_df,on='names',how='left')

        region    sales
names
Jones     West  10000.0
Chris      NaN   5000.0
Piyush    West    440.0
Meera      NaN   6700.0
Anthony   East      NaN
Ellen    South      NaN
Josh      West      NaN
Simran    East      NaN
Oscar    North      NaN